dj140/RTL8762D/src/platform/dfu_flash.c
#include <string.h>
#include "trace.h"
#include "app_section.h"
#include "flash_device.h"
#include "patch_header_check.h"
#include "hw_aes.h"
#include "rtl876x_hw_aes.h"
#include "os_sync.h"
#include "otp.h"
#include "dfu_api.h"
#include "rtl876x_wdg.h"
#include "dfu_flash.h"
#include "sha256.h"
#include "crc16btx.h"
#include "board.h"

/*============================================================================*
 *                              Macros
 *============================================================================*/
#define BTAON_FAST_REBOOT_SW_INFO0      0x2

#define DECODE_OFFSET                           (sizeof(T_COMPRESS_IMG_HEADER_FORMAT))
#define COMPRESS_HEADER_SHA256_OFFSET           36

#define CRC_BUFFER_SIZE                         128  //may modify to improve performance
#define SHA256_BUFFER_SIZE                      128

#define SHA256_LENGTH                           32

/*============================================================================*
 *                               Types
 *============================================================================*/
typedef union _BTAON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint8_t d8;
    struct
    {
        uint8_t rsvd0:                      5;
        uint8_t is_ota:                     1;  /* bit[5]: enter ota mode after reset           */
        uint8_t rsvd1:                      2;
    } flag;
} BTAON_FAST_REBOOT_SW_INFO0_TYPE;

/*============================================================================*
 *                               Variables
 *============================================================================*/

uint8_t g_flash_old_bp_lv = 0xff;
/*============================================================================*
 *                              Local Functions
 *============================================================================*/
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
static bool dfu_check_compressed_image_crc(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  - CRC
        */

    uint8_t buf[CRC_BUFFER_SIZE];
    uint16_t calced_crc16;

    uint32_t length = p_header->payload_len;
    uint8_t *pdata = (uint8_t *) p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    calced_crc16 = dfu_process_crc(BTXFCS_INIT, buf, CRC_BUFFER_SIZE, pdata, length);

    return (p_header->crc16 == calced_crc16);
}

static bool dfu_check_compressed_image_sha256(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  -sha256
        */

    SHA256_CTX ctx;
    uint8_t buf[SHA256_BUFFER_SIZE];
    uint8_t sha256sum[SHA256_LENGTH];
    uint8_t sha256img[SHA256_LENGTH];

    SHA256_Init(&ctx);

    uint8_t *pdata = (uint8_t *)p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, p_header->payload_len);

    SHA256_Final(&ctx, sha256sum);

    pdata = (uint8_t *)p_header + COMPRESS_HEADER_SHA256_OFFSET;
    for (int i = 0; i < SHA256_LENGTH; i++)
    {
        sha256img[i] = *(pdata++);
    }

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
static bool check_compressed_image_chksum(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    bool ret;

    if (p_header->crc16)
    {
        ret = dfu_check_compressed_image_crc(p_header);
    }
    else
    {
        ret = dfu_check_compressed_image_sha256(p_header);
    }

    return ret;
}

#endif
/**
 * @brief erase a sector of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
static uint32_t flash_erase_sector(uint32_t addr)
{
    uint32_t ret = 0;
    bool result = false;
    result = flash_erase_locked(FLASH_ERASE_SECTOR, addr);
    if (!result)
    {
        ret = __LINE__;
    }
    DFU_PRINT_INFO2("<==dfu_flash_erase_sector: addr=%x, result=%d", addr, result);
    return ret;
}

/**
* @brief check flash area is blank
* @param  image_id          image_id to identify FW.
* @param  offset             offset of the image.
* @param  size               size to check.
* @return  0 if blank check successfully, error line number otherwise
*/
static uint32_t dfu_flash_check_blank(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t i = 0;
    uint32_t result = 0;
    uint32_t start_addr = 0;

    if (size & 0x3)
    {
        result = __LINE__;
        goto L_Return;
    }

    if ((image_id != IMAGE_USER_DATA) &&
        (image_id < OTA || image_id >= IMAGE_MAX))
    {
        result = __LINE__;
        goto L_Return;
    }

    if (image_id == IMAGE_USER_DATA)
    {
        start_addr = flash_get_bank_addr(FLASH_BKP_DATA1) + offset;
    }
    else
    {

#ifdef SUPPORT_ALONE_UPPERSTACK_IMG
        start_addr = get_temp_ota_bank_addr_by_img_id_app((T_IMG_ID)image_id) + offset;
#else
        start_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id) + offset;
#endif
    }

    if (start_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    for (i = 0; i < size / 4; i++)
    {
        uint32_t r_data;
        if (flash_auto_read_locked(start_addr, &r_data))
        {
            if (r_data != 0xFFFFFFFF)
            {
                result = __LINE__;
                goto L_Return;
            }
            start_addr += 4;
        }
        else
        {
            result = __LINE__;
            goto L_Return;
        }
    }

L_Return:
    DFU_PRINT_INFO4("<==dfu_flash_check_blank: image_id=0x%x, size=%d, addr=%d, result=%d",
                    image_id, size, start_addr, result);
    return result;
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
*/
void dfu_set_compressed_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /* clear not_ready and compressed_not_ready bit */
    uint32_t data;
    /*support for 4bit mode silent ota*/
    flash_auto_read_locked((uint32_t)p_header, &data);
    data &= ~BIT26;
    flash_auto_write_locked((uint32_t)p_header, data);
}

void dfu_set_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /* clear not_ready bit */
    uint32_t data;
    /*support for 4bit mode silent ota*/
    flash_auto_read_locked((uint32_t)p_header, &data);
    data &= ~BIT23;
    flash_auto_write_locked((uint32_t)p_header, data);
}

/**
* @brief check ota image size whether exceed flash layout address.
*/
static bool check_dfu_update_image_length(uint16_t image_id, uint32_t offset, uint32_t length,
                                          void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = __LINE__;
        return false;
    }

