dj140/RTL8762D/src/platform/dfu_flash.c
    if (length & 0x1)
    {
        result =  __LINE__;
        goto L_Return;
    }

    p16 = (uint16_t *)buf;
    for (i = 0; i < length / 2; ++i)
    {
        checksum16 = checksum16 ^ (*p16);
        ++p16;
    }

    checksum16 = ((checksum16 & 0xff) << 8) | ((checksum16 & 0xff00) >> 8);

    if (checksum16 != crc_val)
    {
        result =  __LINE__;
        goto L_Return;
    }

L_Return:
    DFU_PRINT_INFO4("<==dfu_check_buf_crc: length=%d, checksum16=0x%x, crc_val=0x%x, result:%d",
                    length, checksum16, crc_val, result);
    return result;
}

/**
*  @brief: unlock flash is need when erase or write flash.
*/
bool unlock_flash_bp_all(void)
{
    DFU_PRINT_TRACE0("**********Flash unlock BP***********");
    if (flash_sw_protect_unlock_by_addr_locked(0x00800000, &g_flash_old_bp_lv))
    {
        DFU_PRINT_TRACE1("<==Unlock Total Flash Success! prev_bp_lv=%d", g_flash_old_bp_lv);
        return true;
    }
    return false;
}

/**
*  @brief: lock flash after erase or write flash.
*/
void lock_flash_bp(void)
{
    if (g_flash_old_bp_lv != 0xff)
    {
        flash_set_block_protect_locked(g_flash_old_bp_lv);
    }
}

/**
 * @brief erase a sector of the flash, will retry three times at most
 *
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @return  0 if erase successfully, error line number otherwise,
*/
uint32_t dfu_flash_erase_sector_with_retry(uint16_t image_id, uint32_t offset)
{
    uint32_t result = 0;
    uint32_t cnt = 0;
    uint32_t dfu_base_addr = 0;

    if (image_id == IMAGE_USER_DATA)
    {
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);;
    }
    else
    {
#ifdef SUPPORT_ALONE_UPPERSTACK_IMG
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id_app((T_IMG_ID)image_id);
#else
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#endif
    }
    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    do
    {
        unlock_flash_bp_all();
        flash_erase_sector(dfu_base_addr + offset);
        lock_flash_bp();
        result = dfu_flash_check_blank(image_id, offset, FMC_SEC_SECTION_LEN);

        if (!result)
        {
            //erase ok
            break;
        }
        else
        {
            //retry
            cnt++;
        }
        if (cnt >= 3)
        {
            /*retry three times all fail*/
            goto L_Return;
        }
    }
    while (1);

L_Return:
    DFU_PRINT_INFO2("dfu_flash_erase_with_retry: cnt=%d, result=%d",
                    cnt, result);
    return result;
}


/**
 * @brief  write specified image data with specified length to flash
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @param  length             length of data.
 * @param  p_void             pointer to data.
 * @return 0 if write FW image successfully, error line number otherwise
*/
uint32_t dfu_update(uint16_t image_id, uint32_t offset, uint32_t length,
                    uint32_t/*void*/ *p_void)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr = 0;
    uint32_t start_addr = 0;

    DFU_PRINT_INFO2("==>dfu_update: offset=%d, length=%d", offset, length);

    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (IMAGE_USER_DATA != image_id)
    {
        /*get back up area address*/
#ifdef SUPPORT_ALONE_UPPERSTACK_IMG
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id_app((T_IMG_ID)image_id);
#else
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
#endif
    }
    else
    {
        /*get back up area address*/
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);
    }

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(image_id, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
    if (offset == 0)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        /*access ram addr, make sure image is not ready*/
        p_header->ctrl_flag.flag_value.not_ready = 0x1;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
        if (IMAGE_COMPRESSED == p_header->ctrl_flag.flag_value.image_type)
        {
            /*access ram addr, make sure image is not ready*/
            p_header->ctrl_flag.flag_value.compressed_not_ready = 0x1;
        }

#endif
        DFU_PRINT_TRACE3("<==dfu_update: New Image Header=0x%x, image_id=0x%x, dfu_base_addr=0x%x",
                         length, image_id, dfu_base_addr);
    }
    start_addr = dfu_base_addr + offset;

    unlock_flash_bp_all();
    if ((offset % FMC_SEC_SECTION_LEN) == 0)   //new page starts
    {
        result = flash_erase_sector(start_addr);
    }
    else
    {
        /*write space cross two sector. Note: dfu_base_addr have been 4K align*/
        /*if buffer size more than 4K, may cross more than two sectors*/
        if ((offset / FMC_SEC_SECTION_LEN) != ((offset + length) / FMC_SEC_SECTION_LEN)
            && ((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN))
        {
            /*flash driver will down align 4K*/
            /*only need erase high addr located sector*/
            result = flash_erase_sector((start_addr + length));
        }
    }
    if (result)
    {
        //erase fail
        goto L_Return;
    }

    for (int i = 0; i < length; i = i + 4)
    {
        uint32_t s_val = 0;
        flash_auto_write_locked(start_addr + i, *(uint32_t *)p_void);
        flash_auto_read_locked(start_addr + i | FLASH_OFFSET_TO_NO_CACHE, &s_val);
        if (s_val != *(uint32_t *)p_void)
        {
            DFU_PRINT_ERROR3("<==dfu_update: ERROR! w_data=0x%x, r_data=0x%x, addr=0x%x",
                             *(uint32_t *)p_void, s_val, start_addr + i);
            result = __LINE__; //write fail
            goto L_Return;
        }
        else
        {
            p_void++;
        }
    }
    lock_flash_bp();

